{"words": ["1", "Effective STL", "50 Specific Ways to Improve Your Use of the Standard Template Library", "Scott Meyers", "Addison-Wesley Professional", "2001", "\"This is Effective C++ volume three - it's really that good.\" - Herb Sutter, independent consultant and secretary of the ISO/ANSI C++ standards committee \"There are very few books which all C++ programmers must have. Add Effective STL to that list.\" - Thomas Becker, Senior Software Engineer, Zephyr Associates, Inc., and columnist, C/C++ Users Journal C++'s Standard Template Library is revolutionary, but learning to use it well has always been a challenge. Until now. In this book, best-selling author Scott Meyers ( Effective C++ , and More Effective C++ ) reveals the critical rules of thumb employed by the experts - the things they almost always do or almost always avoid doing - to get the most out of the library. Other books describe what's in the STL. Effective STL shows you how to use it. Each of the book's 50 guidelines is backed by Meyers' legendary analysis and incisive examples, so you'll learn not only what to do, but also when to do it - and why. Highlights of Effective STL include: Advice on choosing among standard STL containers (like vector and list), nonstandard STL containers (like hash_set and hash_map), and non-STL containers (like bitset). Techniques to maximize the efficiency of the STL and the programs that use it. Insights into the behavior of iterators, function objects, and allocators, including things you should not do. Guidance for the proper use of algorithms and member functions whose names are the same (e.g., find), but whose actions differ in subtle (but important) ways. Discussions of potential portability problems, including straightforward ways to avoid them. Like Meyers' previous books, Effective STL is filled with proven wisdom that comes only from experience. Its clear, concise, penetrating style makes it an essential resource for every STL programmer.", "0201749629", "9780201749625", "260", "Computers", "static/images/9780201749625_small.png", "static/images/9780201749625.png", "2", "Climbing Mount Improbable", "", "Richard Dawkins", "Penguin UK", "2006-04-06", "How could such an intricate object as the human eye - so complex and so precise - have come about by chance? Addressing the question, this illustrated book builds a reasoned argument for evolutionary adaptation as the force behind all life on earth.", "0141026170", "9780141026176", "320", "Science", "static/images/9780141026176_small.png", "static/images/9780141026176.png", "3", "Python Essential Reference", "David M. Beazley", "Sams Publishing", "2006", "Python Essential Reference, 3rd Edition,is a comprehensive reference to the Python programming language. The focus of this latest edition is to add coverage of significant new features and new library modules added to the language over the past five years. Clearly written with concise organization, the new features covered include new style classes, unification of types and classes, xmlrpclip, intertools, bz2 and optparse, making it the most up-to-date Python book on the market.", "0672328623", "9780672328626", "625", "static/images/9780672328626_small.png", "static/images/9780672328626.png", "4", "Our Cosmic Habitat", "Martin Rees", "Princeton University Press", "2011-09-19", "Our universe seems strangely ''biophilic,'' or hospitable to life. Is this happenstance, providence, or coincidence? According to cosmologist Martin Rees, the answer depends on the answer to another question, the one posed by Einstein's famous remark: ''What interests me most is whether God could have made the world differently.'' This highly engaging book explores the fascinating consequences of the answer being ''yes.'' Rees explores the notion that our universe is just a part of a vast ''multiverse,'' or ensemble of universes, in which most of the other universes are lifeless. What we call the laws of nature would then be no more than local bylaws, imposed in the aftermath of our own Big Bang. In this scenario, our cosmic habitat would be a special, possibly unique universe where the prevailing laws of physics allowed life to emerge. Rees begins by exploring the nature of our solar system and examining a range of related issues such as whether our universe is or isn't infinite. He asks, for example: How likely is life? How credible is the Big Bang theory? Rees then peers into the long-range cosmic future before tracing the causal chain backward to the beginning. He concludes by trying to untangle the paradoxical notion that our entire universe, stretching 10 billion light-years in all directions, emerged from an infinitesimal speck. As Rees argues, we may already have intimations of other universes. But the fate of the multiverse concept depends on the still-unknown bedrock nature of space and time on scales a trillion trillion times smaller than atoms, in the realm governed by the quantum physics of gravity. Expanding our comprehension of the cosmos, Our Cosmic Habitat will be read and enjoyed by all those--scientists and nonscientists alike--who are as fascinated by the universe we inhabit as is the author himself.", "1400841070", "9781400841073", "224", "static/images/9781400841073_small.png", "static/images/9781400841073.png", "5", "Packing for Mars", "The Curious Science of Life in the Void", "Mary Roach", "W W Norton & Company Incorporated", "2010", "Describes the weirdness of space travel, answers questions about the long-term effects of living in zero gravity on the human body, and explains how space simulations on Earth can provide a preview to life in space.", "0393068471", "9780393068474", "334", "static/images/9780393068474_small.png", "static/images/9780393068474.png", "6", "The Collected Stories", "Arthur C. Clarke", "Orion Publishing Group"]}